ci4_att/app/Controllers/ClientesController.php

    public function index(): string
    {
        $clientes = new ClientesModel();
        $datos ['datos']=$clientes->findAll();
---
SELECT *
FROM `clientes`