ci4_att/app/Controllers/HotelesController.php

    public function index(): string
    {
        $hoteles = new HotelesModel();
        $datos ['datos']=$hoteles->findAll();
---
SELECT *
FROM `hoteles`